## Support Vector Machine

<img src="Svm_photo.jpg" width='80%'>

```for 2-d data = line```
```for 3-d data = plane```

<img src="SvmDiagram.png" width="50%">

#### for more details visit these sites
[Chatgpt link for svm](https://chat.openai.com/share/68660d4a-a250-800b-80af-1e4e4c90ac08)

[Analytic vidhya](https://www.analyticsvidhya.com/blog/2021/10/support-vector-machinessvm-a-complete-guide-for-beginners/)

#### let's implement it

In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix,classification_report,accuracy_score

In [2]:
df=pd.read_csv("income_evaluation.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              32561 non-null  int64
 1    workclass       32561 non-null  object
 2    fnlwgt          32561 non-null  int64
 3    education       32561 non-null  object
 4    education-num   32561 non-null  int64
 5    marital-status  32561 non-null  object
 6    occupation      32561 non-null  object
 7    relationship    32561 non-null  object
 8    race            32561 non-null  object
 9    sex             32561 non-null  object
 10   capital-gain    32561 non-null  int64
 11   capital-loss    32561 non-null  int64
 12   hours-per-week  32561 non-null  int64
 13   native-country  32561 non-null  object
 14   income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [3]:
df.columns

Index(['age', ' workclass', ' fnlwgt', ' education', ' education-num',
       ' marital-status', ' occupation', ' relationship', ' race', ' sex',
       ' capital-gain', ' capital-loss', ' hours-per-week', ' native-country',
       ' income'],
      dtype='object')

In [4]:
df.duplicated().sum()

np.int64(24)

In [5]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

np.int64(0)

In [6]:
df.isnull().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

In [7]:
df.dropna(inplace=True)

In [8]:
np.unique(df[' income'])

array([' <=50K', ' >50K'], dtype=object)

In [9]:
df.drop(' fnlwgt',axis=1,inplace=True)

In [10]:
#to deal with space
col_name=['age', 'workclass', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income']
df.columns=col_name
df.columns

Index(['age', 'workclass', 'education', 'education-num', 'marital-status',
       'occupation', 'relationship', 'race', 'sex', 'capital-gain',
       'capital-loss', 'hours-per-week', 'native-country', 'income'],
      dtype='object')

In [11]:
df.loc[df['workclass']==' ?','workclass']=np.nan
df.loc[df['education']==' ?','education']=np.nan
df.loc[df['occupation']==' ?','occupation']=np.nan
df.loc[df['native-country']==' ?','native-country']=np.nan

In [12]:
df.isnull().sum()
df.dropna(inplace=True)
df.isnull().sum()

age               0
workclass         0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [13]:
df['income']=df['income'].map({' <=50K':0,' >50K':1})

In [14]:
df['income'].value_counts()

income
0    22633
1     7506
Name: count, dtype: int64

In [15]:
cat_col=df.select_dtypes(include='object')
cat_col.head()

,workclass,education,marital-status,occupation,relationship,race,sex,native-country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [16]:
num_col=df.select_dtypes(exclude='object')
num_col.head()

   age  education-num  capital-gain  capital-loss  hours-per-week  income
0   39             13          2174             0              40       0
1   50             13             0             0              13       0
2   38              9             0             0              40       0
3   53              7             0             0              40       0
4   28             13             0             0              40       0

In [17]:
# Data balance

In [18]:
# label processing
from sklearn.preprocessing import LabelEncoder
# def Label_encod():
#     le=LabelEncoder()
#     df[a]=le.fit_transform(df[a])
le=LabelEncoder()
cat_col_encoded=cat_col.apply(le.fit_transform)
cat_col_encoded.head()

,workclass,education,marital-status,occupation,relationship,race,sex,native-country
0,5,9,4,0,1,4,1,38
1,4,9,2,3,0,4,1,38
2,2,11,0,5,1,4,1,38
3,2,1,2,5,0,2,1,38
4,2,9,2,9,5,2,0,4

In [19]:
# cat_col.columns
# label_list=['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'native-country'
#             ]
# for a in label_list:
#     Label_encod()

# df.head()

In [20]:
final_df=pd.concat([num_col,cat_col_encoded],axis=1)
final_df.head()

,age,education-num,capital-gain,capital-loss,hours-per-week,income,workclass,education,marital-status,occupation,relationship,race,sex,native-country
0,39,13,2174,0,40,0,5,9,4,0,1,4,1,38
1,50,13,0,0,13,0,4,9,2,3,0,4,1,38
2,38,9,0,0,40,0,2,11,0,5,1,4,1,38
3,53,7,0,0,40,0,2,1,2,5,0,2,1,38
4,28,13,0,0,40,0,2,9,2,9,5,2,0,4

In [21]:
x=final_df.drop('income',axis=1)
y=final_df[['income']]

In [22]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [23]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
x_train_scaled = scaler.fit_transform(x_train)
x_test_scaled = scaler.transform(x_test)

# If you are predicting a single row:
new_data = x_test.iloc[0]  # This is a Series
new_data_scaled = scaler.transform(pd.DataFrame([new_data]))

In [ ]:
from sklearn.svm import SVC
model=SVC(kernel='linear')
model.fit(x_train,y_train)

c:\Users\dell\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\validation.py:1406: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)